# №2 Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# spisk = [2, 3, 4, 5, 6]
# spisksum = []
# for i in range(len(spisk)):
#     a = spisk[i] * spisk[len(spisk)-i-1]
#     if a not in spisksum:
#      spisksum.append(a)  
# print(spisksum)

