# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19


# spisk = [1.1, 1.2, 3.1, 5, 10.01]
# spisk2 = []
# for i in spisk:
#  if i % 1 != 0:
#     spisk1 = round(i % 1, 2) 
#     spisk2.append(spisk1)
# print(max(spisk2) - min(spisk2))

